Revit 2027 API
ModelPathUtils.IsValidUserVisibleFullServerPath Method
 Determines whether the given string represents a valid server path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidUserVisibleFullServerPath(
	string strPath
)
Public Shared Function IsValidUserVisibleFullServerPath (
	strPath As String
) As Boolean
public:
static bool IsValidUserVisibleFullServerPath(
	String^ strPath
)
static member IsValidUserVisibleFullServerPath :
        strPath : string -> bool
Parameters
strPath String
 The path, in string form
Return Value
Boolean
 True if the given path is a valid server path, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
ServerPaths must refer to Revit models.
ServerPaths are relative to the central server location, and are of the form "RSN://{HostNodeName}/{model_path}".
The {model_path} portion is a relative path to a Revit model. For example:
RSN://EXS/hospital.rvt
RSN://EXS.autodesk.com/Old Files/hotel2.rvt
RSN://EXS.autodesk.com/Old Files/Last Week/Tuesday\hotel2.rvt
 are all valid server paths.
//EXS/Old Files/.rvt
EXS/hospital
 are not valid server paths. If this function returns false, it does not necessarily mean the given path is a file path. It may be a malformed string.
See Also
Reference
ModelPathUtils Class
Autodesk.Revit.DB Namespace